ContentsViewer/Arduino-ArduinOS/MegaOS/hardware/avr/boards.txt
## Arduino Mega w/ ATmega1280
## -------------------------
mega.menu.cpu.atmega1280=ATmega1280

mega.menu.cpu.atmega1280.upload.protocol=arduino
mega.menu.cpu.atmega1280.upload.maximum_size=126976
mega.menu.cpu.atmega1280.upload.speed=57600

mega.menu.cpu.atmega1280.bootloader.high_fuses=0xDA
mega.menu.cpu.atmega1280.bootloader.extended_fuses=0xF5
mega.menu.cpu.atmega1280.bootloader.file=atmega/ATmegaBOOT_168_atmega1280.hex

mega.menu.cpu.atmega1280.build.mcu=atmega1280
mega.menu.cpu.atmega1280.build.board=AVR_MEGA

##############################################################

megaMegaOS.name=Arduino/Genuino Mega or Mega 2560 + MegaOS

megaMegaOS.vid.0=0x2341
megaMegaOS.pid.0=0x0010
megaMegaOS.vid.1=0x2341
megaMegaOS.pid.1=0x0042
megaMegaOS.vid.2=0x2A03
megaMegaOS.pid.2=0x0010
megaMegaOS.vid.3=0x2A03
megaMegaOS.pid.3=0x0042
megaMegaOS.vid.4=0x2341
megaMegaOS.pid.4=0x0210
megaMegaOS.vid.5=0x2341
megaMegaOS.pid.5=0x0242

megaMegaOS.upload.tool=avrdude
megaMegaOS.upload.maximum_data_size=8192

megaMegaOS.bootloader.tool=avrdude
megaMegaOS.bootloader.low_fuses=0xFF
megaMegaOS.bootloader.unlock_bits=0x3F
megaMegaOS.bootloader.lock_bits=0x0F

megaMegaOS.build.f_cpu=16000000L
megaMegaOS.build.core=arduino.MegaOS
megaMegaOS.build.variant=mega
# default board may be overridden by the cpu menu
megaMegaOS.build.board=AVR_MEGA2560

## Arduino/Genuino Mega w/ ATmega2560
## -------------------------
megaMegaOS.menu.cpu.atmega2560=ATmega2560 (Mega 2560)

megaMegaOS.menu.cpu.atmega2560.upload.protocol=wiring
megaMegaOS.menu.cpu.atmega2560.upload.maximum_size=253952
megaMegaOS.menu.cpu.atmega2560.upload.speed=115200

megaMegaOS.menu.cpu.atmega2560.bootloader.high_fuses=0xD8
megaMegaOS.menu.cpu.atmega2560.bootloader.extended_fuses=0xFD
megaMegaOS.menu.cpu.atmega2560.bootloader.file=stk500v2/stk500boot_v2_mega2560.hex

megaMegaOS.menu.cpu.atmega2560.build.mcu=atmega2560
megaMegaOS.menu.cpu.atmega2560.build.board=AVR_MEGA2560

## Arduino Mega w/ ATmega1280
## -------------------------
megaMegaOS.menu.cpu.atmega1280=ATmega1280

megaMegaOS.menu.cpu.atmega1280.upload.protocol=arduino
megaMegaOS.menu.cpu.atmega1280.upload.maximum_size=126976
megaMegaOS.menu.cpu.atmega1280.upload.speed=57600

megaMegaOS.menu.cpu.atmega1280.bootloader.high_fuses=0xDA
megaMegaOS.menu.cpu.atmega1280.bootloader.extended_fuses=0xF5
megaMegaOS.menu.cpu.atmega1280.bootloader.file=atmega/ATmegaBOOT_168_atmega1280.hex

megaMegaOS.menu.cpu.atmega1280.build.mcu=atmega1280
megaMegaOS.menu.cpu.atmega1280.build.board=AVR_MEGA

##############################################################

megaADK.name=Arduino Mega ADK

megaADK.vid.0=0x2341
megaADK.pid.0=0x003f
megaADK.vid.1=0x2341
megaADK.pid.1=0x0044
megaADK.vid.2=0x2A03
megaADK.pid.2=0x003f
megaADK.vid.3=0x2A03
megaADK.pid.3=0x0044

megaADK.upload.tool=avrdude
megaADK.upload.protocol=wiring
megaADK.upload.maximum_size=253952
megaADK.upload.maximum_data_size=8192
megaADK.upload.speed=115200

megaADK.bootloader.tool=avrdude
megaADK.bootloader.low_fuses=0xFF
megaADK.bootloader.high_fuses=0xD8
megaADK.bootloader.extended_fuses=0xFD
megaADK.bootloader.file=stk500v2/stk500boot_v2_mega2560.hex
megaADK.bootloader.unlock_bits=0x3F
megaADK.bootloader.lock_bits=0x0F

megaADK.build.mcu=atmega2560
megaADK.build.f_cpu=16000000L
megaADK.build.board=AVR_ADK
megaADK.build.core=arduino
megaADK.build.variant=mega

##############################################################

leonardo.name=Arduino Leonardo
leonardo.vid.0=0x2341
leonardo.pid.0=0x0036
leonardo.vid.1=0x2341
leonardo.pid.1=0x8036
leonardo.vid.2=0x2A03
leonardo.pid.2=0x0036
leonardo.vid.3=0x2A03
leonardo.pid.3=0x8036

leonardo.upload.tool=avrdude
leonardo.upload.protocol=avr109
leonardo.upload.maximum_size=28672
leonardo.upload.maximum_data_size=2560
leonardo.upload.speed=57600
leonardo.upload.disable_flushing=true
leonardo.upload.use_1200bps_touch=true
leonardo.upload.wait_for_upload_port=true

leonardo.bootloader.tool=avrdude
leonardo.bootloader.low_fuses=0xff
leonardo.bootloader.high_fuses=0xd8
leonardo.bootloader.extended_fuses=0xcb
leonardo.bootloader.file=caterina/Caterina-Leonardo.hex
leonardo.bootloader.unlock_bits=0x3F
leonardo.bootloader.lock_bits=0x2F

leonardo.build.mcu=atmega32u4
leonardo.build.f_cpu=16000000L
leonardo.build.vid=0x2341
leonardo.build.pid=0x8036
leonardo.build.usb_product="Arduino Leonardo"
leonardo.build.board=AVR_LEONARDO
leonardo.build.core=arduino
leonardo.build.variant=leonardo
leonardo.build.extra_flags={build.usb_flags}

##############################################################

micro.name=Arduino/Genuino Micro

micro.vid.0=0x2341
micro.pid.0=0x0037
micro.vid.1=0x2341
micro.pid.1=0x8037
micro.vid.2=0x2A03
micro.pid.2=0x0037
micro.vid.3=0x2A03
micro.pid.3=0x8037

micro.vid.4=0x2341
micro.pid.4=0x0237
# If the board is a 2341:0237 use 2341:8237 for build and set
# other parameters as well
micro.vid.4.build.vid=0x2341
micro.vid.4.build.pid=0x8237
micro.vid.4.build.usb_product="Genuino Micro"
micro.vid.4.bootloader.file=caterina/Caterina-Genuino-Micro.hex

micro.vid.5=0x2341
micro.pid.5=0x8237
# If the board is a 2341:8237 use 2341:8237 for build and set
# other paramters as well
micro.vid.5.build.vid=0x2341
micro.vid.5.build.pid=0x8237
micro.vid.5.build.usb_product="Genuino Micro"
micro.vid.5.bootloader.file=caterina/Caterina-Genuino-Micro.hex

micro.upload.tool=avrdude
micro.upload.protocol=avr109
micro.upload.maximum_size=28672
micro.upload.maximum_data_size=2560
micro.upload.speed=57600
micro.upload.disable_flushing=true
micro.upload.use_1200bps_touch=true
micro.upload.wait_for_upload_port=true

micro.bootloader.tool=avrdude
micro.bootloader.low_fuses=0xff
micro.bootloader.high_fuses=0xd8
micro.bootloader.extended_fuses=0xcb
micro.bootloader.file=caterina/Caterina-Micro.hex
micro.bootloader.unlock_bits=0x3F
micro.bootloader.lock_bits=0x2F

micro.build.mcu=atmega32u4
micro.build.f_cpu=16000000L
micro.build.vid=0x2341
micro.build.pid=0x8037
micro.build.usb_product="Arduino Micro"
micro.build.board=AVR_MICRO
micro.build.core=arduino
micro.build.variant=micro
micro.build.extra_flags={build.usb_flags}

