ContentsViewer/Arduino-ArduinOS/MegaOS/hardware/avr/boards.txt
robotControl.upload.tool=avrdude
robotControl.upload.protocol=avr109
robotControl.upload.maximum_size=28672
robotControl.upload.maximum_data_size=2560
robotControl.upload.speed=57600
robotControl.upload.disable_flushing=true
robotControl.upload.use_1200bps_touch=true
robotControl.upload.wait_for_upload_port=true

robotControl.bootloader.tool=avrdude
robotControl.bootloader.low_fuses=0xff
robotControl.bootloader.high_fuses=0xd8
robotControl.bootloader.extended_fuses=0xcb
robotControl.bootloader.file=caterina-Arduino_Robot/Caterina-Robot-Control.hex
robotControl.bootloader.unlock_bits=0x3F
robotControl.bootloader.lock_bits=0x2F

robotControl.build.mcu=atmega32u4
robotControl.build.f_cpu=16000000L
robotControl.build.vid=0x2341
robotControl.build.pid=0x8038
robotControl.build.usb_product="Robot Control"
robotControl.build.board=AVR_ROBOT_CONTROL
robotControl.build.core=arduino
robotControl.build.variant=robot_control
robotControl.build.extra_flags={build.usb_flags}

##############################################################

robotMotor.name=Arduino Robot Motor
robotMotor.vid.0=0x2341
robotMotor.pid.0=0x0039
robotMotor.vid.1=0x2341
robotMotor.pid.1=0x8039
robotMotor.vid.2=0x2A03
robotMotor.pid.2=0x0039
robotMotor.vid.3=0x2A03
robotMotor.pid.3=0x8039

robotMotor.upload.tool=avrdude
robotMotor.upload.protocol=avr109
robotMotor.upload.maximum_size=28672
robotMotor.upload.maximum_data_size=2560
robotMotor.upload.speed=57600
robotMotor.upload.disable_flushing=true
robotMotor.upload.use_1200bps_touch=true
robotMotor.upload.wait_for_upload_port=true

robotMotor.bootloader.tool=avrdude
robotMotor.bootloader.low_fuses=0xff
robotMotor.bootloader.high_fuses=0xd8
robotMotor.bootloader.extended_fuses=0xcb
robotMotor.bootloader.file=caterina-Arduino_Robot/Caterina-Robot-Motor.hex
robotMotor.bootloader.unlock_bits=0x3F
robotMotor.bootloader.lock_bits=0x2F

robotMotor.build.mcu=atmega32u4
robotMotor.build.f_cpu=16000000L
robotMotor.build.vid=0x2341
robotMotor.build.pid=0x8039
robotMotor.build.usb_product="Robot Motor"
robotMotor.build.board=AVR_ROBOT_MOTOR
robotMotor.build.core=arduino
robotMotor.build.variant=robot_motor
robotMotor.build.extra_flags={build.usb_flags}

##############################################################

gemma.vid.0=0x2341
gemma.pid.0=0x0c9f

gemma.name=Arduino Gemma

gemma.bootloader.low_fuses=0xF1
gemma.bootloader.high_fuses=0xD5
gemma.bootloader.extended_fuses=0xFE
gemma.bootloader.tool=avrdude
gemma.bootloader.lock_bits=
gemma.bootloader.unlock_bits=
gemma.bootloader.file=gemma/gemma_v1.hex

gemma.build.mcu=attiny85
gemma.build.f_cpu=8000000L
gemma.build.core=arduino
gemma.build.variant=gemma
gemma.build.board=AVR_GEMMA

gemma.upload.tool=avrdude
gemma.upload.maximum_size=5310

##############################################################


int8m328.name=Arduino ATmega328 Internal 8MHz

int8m328.upload.tool=avrdude
int8m328.upload.protocol=arduino
int8m328.upload.maximum_size=30720
int8m328.upload.maximum_data_size=2048
int8m328.upload.speed=57600

int8m328.bootloader.tool=avrdude
int8m328.bootloader.low_fuses=0xe2
int8m328.bootloader.high_fuses=0xDA
int8m328.bootloader.extended_fuses=0x05
int8m328.bootloader.unlock_bits=0x3F
int8m328.bootloader.lock_bits=0x0F
int8m328.bootloader.file=atmega/ATmegaBOOT_168_atmega328_pro_8MHz.hex

int8m328.build.mcu=atmega328p
int8m328.build.f_cpu=8000000L
int8m328.build.board=AVR_PRO
int8m328.build.core=arduino
int8m328.build.variant=standard
##############################################################


int8m328MegaOS.name=Arduino ATmega328 Internal 8MHz + MegaOS

int8m328MegaOS.upload.tool=avrdude
int8m328MegaOS.upload.protocol=arduino
int8m328MegaOS.upload.maximum_size=30720
int8m328MegaOS.upload.maximum_data_size=2048
int8m328MegaOS.upload.speed=57600

int8m328MegaOS.bootloader.tool=avrdude
int8m328MegaOS.bootloader.low_fuses=0xe2
int8m328MegaOS.bootloader.high_fuses=0xDA
int8m328MegaOS.bootloader.extended_fuses=0x05
int8m328MegaOS.bootloader.unlock_bits=0x3F
int8m328MegaOS.bootloader.lock_bits=0x0F
int8m328MegaOS.bootloader.file=atmega/ATmegaBOOT_168_atmega328_pro_8MHz.hex

int8m328MegaOS.build.mcu=atmega328p
int8m328MegaOS.build.f_cpu=8000000L
int8m328MegaOS.build.board=AVR_PRO
int8m328MegaOS.build.core=arduino.MegaOS
int8m328MegaOS.build.variant=standard

##############################################################


int8m168.name=Arduino ATmega168 Internal 8MHz

int8m168.upload.tool=avrdude
int8m168.upload.protocol=arduino
int8m168.upload.maximum_size=14336
int8m168.upload.maximum_data_size=1024
int8m168.upload.speed=19200

int8m168.bootloader.tool=avrdude
int8m168.bootloader.low_fuses=0xe2
int8m168.bootloader.high_fuses=0xDD
int8m168.bootloader.extended_fuses=0x00
int8m168.bootloader.unlock_bits=0x3F
int8m168.bootloader.lock_bits=0x0F
int8m168.bootloader.file=atmega/ATmegaBOOT_168_pro_8MHz.hex

int8m168.build.mcu=atmega168
int8m168.build.f_cpu=8000000L
int8m168.build.board=AVR_PRO
int8m168.build.core=arduino
int8m168.build.variant=standard

##############################################################


int8m168MegaOS.name=Arduino ATmega168 Internal 8MHz + MegaOS

int8m168MegaOS.upload.tool=avrdude
int8m168MegaOS.upload.protocol=arduino
int8m168MegaOS.upload.maximum_size=14336
int8m168MegaOS.upload.maximum_data_size=1024
int8m168MegaOS.upload.speed=19200

int8m168MegaOS.bootloader.tool=avrdude
int8m168MegaOS.bootloader.low_fuses=0xe2
int8m168MegaOS.bootloader.high_fuses=0xDD
int8m168MegaOS.bootloader.extended_fuses=0x00
int8m168MegaOS.bootloader.unlock_bits=0x3F
int8m168MegaOS.bootloader.lock_bits=0x0F
int8m168MegaOS.bootloader.file=atmega/ATmegaBOOT_168_pro_8MHz.hex

int8m168MegaOS.build.mcu=atmega168
int8m168MegaOS.build.f_cpu=8000000L
int8m168MegaOS.build.board=AVR_PRO
int8m168MegaOS.build.core=arduino.MegaOS
int8m168MegaOS.build.variant=standard
